МПР/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <attributes>
    <name>ПредставлениеШтрихкода</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Справки2ЕГАИС</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МПР/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20/120</comment>
  </enumValues>
</mdclass:Enum>

МПР/src/CommonModules/ОбщегоНазначенияРМКРТКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ПоясняющиеНадписи

// Позволяет переопределить текст подсказки настройки запрета продаж
//
// Параметры:
//  ТекстПодсказки - Строка - в этот параметр нужно записать результат.
//
Процедура ЗаполнитьТекстПодсказкиНастройкиЗапретовПродаж(ТекстПодсказки) Экспорт
	ТекстПодсказки = НСтр("ru = 'Ограничение продажи товаров (см. маркетинговые акции, запрещающие продажу товаров.'");
КонецПроцедуры
	
#КонецОбласти

//  Возвращает признак стандартной обработки выбора кода доступа в таблице настройки помощника
//
// Возвращаемое значение:
//  Результат - Булево
//
Функция ЭтоСтандартнаяОбработкаВыбораКодаДоступаВИнтерфейсеПомощникаНастройкиРМК() Экспорт
	Возврат Ложь;
КонецФункции

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения.
//
// Параметры:
//  Объект - ДанныеФормыКоллекция - данные объекта формы рабочего места кассира.
//  ТекущаяСтрока - Структура - строка табличной части товаров для обработки.
//
Процедура РассчитатьСуммуНДС(Объект, ТекущаяСтрока) Экспорт
	
	СистемаНалогообложения = ТекущаяСтрока.СистемаНалогообложения;
	
	Если СистемаНалогообложения <> ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ОСН") Тогда
		ТекущаяСтрока.СуммаНДС = 0;
	Иначе
		
		ЗначениеСтавкиНДС = СтавкаНДСЧислом(ТекущаяСтрока.СтавкаНДС);
		
		ТекущаяСтрока.СуммаНДС = ?(Объект.ЦенаВключаетНДС,
			ТекущаяСтрока.Сумма * ЗначениеСтавкиНДС / (ЗначениеСтавкиНДС + 1),
			ТекущаяСтрока.Сумма * ЗначениеСтавкиНДС);
	
	КонецЕсли;
	
КонецПроцедуры

// Возвращает имя метаданных, хранящих особенности учета товара
//
// Возвращаемое значение:
//  Результат - Строка
//
Функция ИмяМетаданныхОсобенностиУчета() Экспорт
	Возврат "";
КонецФункции

// Возвращает имя метаданных, хранящих особенности учета товара
//
// Возвращаемое значение:
//  Результат - Строка
//
Функция ИмяМетаданныхВидовНоменклатуры() Экспорт
	Возврат "";
КонецФункции

// Возвращает имя реквизита номенклатуры, хранящего вид сущности
//
// Возвращаемое значение:
//  Результат - Строка
//
Функция ИмяРеквизитаВидаНоменклатуры() Экспорт
	Возврат "";
КонецФункции

// Возвращает имя реквизита номенклатуры, хранящего особенность учета сущности
//
// Возвращаемое значение:
//  Результат - Строка
//
Функция ИмяРеквизитаОсобенностиУчета() Экспорт
	Возврат "";
КонецФункции

// Возвращает вид отображения переключателя элемента интерфейса, отображающего тип Булево
//
// Возвращаемое значение:
//  Результат - ВидФлажка
//
Функция ВидОтображенияБинарногоПоля() Экспорт
	Возврат ВидФлажка.Флажок;
КонецФункции

// Возвращает положение заголовка переключателя элемента интерфейса, отображающего тип Булево
//
// Возвращаемое значение:
//  Результат - ПоложениеЗаголовкаЭлементаФормы
//
Функция ПоложениеЗаголовкаЭлемента() Экспорт
	Возврат ПоложениеЗаголовкаЭлементаФормы.Право;
КонецФункции

// Возвращает текст сообщения с рекомендациями по исправлению ситуации невозможности определения кассы
//
// Возвращаемое значение:
//  Результат - Строка - текст сообщения об ошибке определения кассы
//
Функция ТекстСообщенияОбОшибкеОпределенияКассы() Экспорт
	Возврат "";
КонецФункции

// Возвращает текст сообщения с рекомендациями по исправлению ситуации невозможности определения настроек РМК
//
// Возвращаемое значение:
//  Результат - Строка - текст сообщения об ошибке определения кассы
//
Функция ТекстСообщенияОбОшибкеОпределенияНастройкиРМК() Экспорт
	Возврат "";
КонецФункции

// Возвращает текст запроса на получение последнего назначенного штрихкода сотрудника
//
// Возвращаемое значение:
//  Результат - Строка - текст запроса
//
Функция ТекстЗапросаПоследнегоНазначенногоШтрихкодаСотрудника() Экспорт
	
	Возврат "ВЫБРАТЬ
	|	МАКСИМУМ(ПОДСТРОКА(Штрихкоды.Штрихкод, 5, 8)) КАК Код
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод ПОДОБНО &ШаблонШтрихкод
	|	И Штрихкоды.Владелец ССЫЛКА Справочник.ИнформационныеКарты";
	
КонецФункции

// Определяет имя основной таблицы для списка видов оплат в помощнике настройки кассового места
//
// Параметры:
//  ИмяТаблицы - Строка - имя основной таблицы видов оплат до переопределения.
//
Процедура ЗаполнитьИмяОсновнойТаблицыВидовОплат(ИмяТаблицы) Экспорт
	ИмяТаблицы = "Справочник.ВидыОплатЧекаККМ";
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает числовое значение ставки НДС по значению перечисления.
//
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
//  Число - ставка ндс.
//
Функция СтавкаНДСЧислом(СтавкаНДС)
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10")
		ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") Тогда
			Возврат 0.1;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18")
		ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") Тогда
			Возврат 0.18;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20")
		ИЛИ СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") Тогда
			Возврат 0.2;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
